In [2]:
import pandas as pd

In [17]:
pd.read_excel(r'C:\Users\HP\Desktop\myexceldata.xlsx')

       name    batch   roll no  grade
0  prakash    python         19     a
1      bob    python         30    a+
2   chetan       java        11     o
3   suyash   p[ython         15     a

In [24]:
pd.read_csv(r'C:\Users\HP\Desktop\bookcsv.csv')

    name    batch   rollno  grade
0   karan   python       12     a
1   arjun   python       14     b
2  kushal    java        18     c
3  hitesh  python        16     b

In [5]:
pd.read_csv(r"C:\Users\HP\Desktop\books.tsv",sep='\t')

      name rollno  grade
jay     11      a    NaN
hema    12      b    NaN
bob     15      c    NaN